{
  "chunk_id": "positive_relationship_chunk_1",
  "category": "positive_relationship",
  "created_at": "2025-06-03T16:16:25.966291",
  "start_index": 0,
  "end_index": 24,
  "message_count": 25,
  "messages": [
    {
      "message_id": "fd11e01e-7958-4e90-bd5a-e1d69acbacd8",
      "timestamp": "2021-11-06 06:16:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Loved \"Your love is more beautiful than the great art I've seen. \nThe brushstrokes of your friendship is deep and enticing.\nOur system of working together makes me feel exhilarated and safe. \nTravelling with you on this life journey is warm, fresh and joyful. Like morning coffee ☕️ and indoor plants 🌱 \nSweet dreams\"",
      "message_type": "iMessage",
      "sentiment_compound": 0.9915,
      "sentiment_category": "positive",
      "keywords": "love,together"
    },
    {
      "message_id": "63f2cd67-37ee-4ad9-a789-8fbf8fbfdc9c",
      "timestamp": "2022-06-14 13:34:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Loved \"Dear Adam\n\nHave I told you yet today that I love you?\n\nI feel so proud of you for fitting in your work and studies. But I'll also feel proud of you if you don't or if you choose a different path. When I saw you today doing your play with your baby, after just doing an exam, I was so impressed.\n\nI felt so proud when you used our agreed upon discipline plan yesterday with Joshua. \n\nYou are my hero of the day.\n\nLouisa\"",
      "message_type": "iMessage",
      "sentiment_compound": 0.9895,
      "sentiment_category": "positive",
      "keywords": "love"
    },
    {
      "message_id": "97a8fbff-9c27-4b0a-ab17-61bb10e12210",
      "timestamp": "2022-01-06 18:32:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "This house that I planned to go to is my grandparents house which I told you I was going to. \n\nAgain I did not choose any sides because choosing sides is a ridiculous concept to begin with, you had stated to my Aunty about events that occurred 40-50 years ago about my grandparents, this was your choice to send that message not me, not Lily and not Joshua it was yours. You knew that message would have reactions that weren't going to be in your favour. I'm sorry that this happened and even when it did happen I still stayed with you Louisa. \n\nI have not lied about you to my family. I don't know where you are getting this from but it is not true. \n\nI did not assault you Louisa. We were both in a tight space and I wanted to get through it and you to stood in the way. I apologise that I bumped you into you and wasn't my intention as I thought you were going to move out the way. \n\nI didn't want to leave at all. You had put me in a situation where I have zero choice for both the kids, you state to me that I'm a parent yet you take the choices that parents have for kids away from me. I did not feel like part of the family unit at all Lou. You told me that getting a free car to help me, to help us, to help the family work together would be disrespectful. It doesn't matter where I was getting the car or who I was getting it from. I was looking at the bigger picture so that our family could be more functional especially between you and I but you did not see that. \n\nI don't know what to do with us...I love you Louisa and I always will and I love the kids and I do want to see them BOTH. ",
      "message_type": "iMessage",
      "sentiment_compound": 0.9857,
      "sentiment_category": "positive",
      "keywords": "love,help,together,sorry"
    },
    {
      "message_id": "efced188-d313-4594-9643-2e84541ff274",
      "timestamp": "2022-06-11 16:29:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Louisa I haven't made you feel like any of this. It is not a domestic violence relationship, I did not threaten Lily I was playing around with her like every other parent does with their kids (play wrestling) but you don't see it that way. I did not make you lose your job I am not making you lose your friends, I've spent most of my day helping you get things ready and get your shopping for your party, a domestic violence perpetrator wouldn't have done that and would have made you do everything yourself and then would tell you to not go to the party etc. ",
      "message_type": "iMessage",
      "sentiment_compound": 0.9815,
      "sentiment_category": "positive"
    },
    {
      "message_id": "027b90ac-11d0-4bd1-8069-013670f8cd00",
      "timestamp": "2022-09-11 16:15:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Hi there Jo, can you tell everyone that we are so thankful for the support and love we highly appreciate it a lot. That would be really helpful  for us here, my bank details are\n\nName Adam Edwards \nBSB 066508\nACC 10120201\n\nCan't thank you and everyone else enough honestly, thanks for everything you've all been amazing ❤️❤️",
      "message_type": "iMessage",
      "sentiment_compound": 0.9784,
      "sentiment_category": "positive",
      "keywords": "love,support,appreciate,thank"
    },
    {
      "message_id": "72adc663-c6d7-4dc3-be62-2abff22e208f",
      "timestamp": "2022-08-09 21:44:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "You are\nStrong\nBeautiful \nKind\nPassionate\nHappy\nLoving\n☺️",
      "message_type": "iMessage",
      "sentiment_compound": 0.9705,
      "sentiment_category": "positive",
      "keywords": "happy"
    },
    {
      "message_id": "f035cb30-eb2b-4401-8018-2a903a59f3a2",
      "timestamp": "2022-08-09 21:43:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Loved \"You are strong\nPerfect\nWhole\nPowerful \nLoving, and\nHarmonious\n\"",
      "message_type": "iMessage",
      "sentiment_compound": 0.9666,
      "sentiment_category": "positive"
    },
    {
      "message_id": "961b9776-b925-4aa3-95c2-faa061a2826c",
      "timestamp": "2021-09-30 09:21:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Then he must've had a really good supporting family when he was growing up, it sounds like the first like 16 years of his life seemed really good. But obviously he would've had some bad things happened to him, it just sounds like it didn't stick with him. Like I'm not sure how old he was when he got the ball thrown at him by his younger sibling but I can imagine that before that ball was thrown they would've been best friends and played and was happy and then all of a sudden he got physically hurt by his brother and that's why I think that's why he has said that's the worst thing that happened to him, trust me when you have someone physically hurt you after you've had all this fun it sticks with you. ",
      "message_type": "iMessage",
      "sentiment_compound": 0.9659,
      "sentiment_category": "positive",
      "keywords": "trust,happy,good,best"
    },
    {
      "message_id": "d0b778f2-26a7-4e35-9874-830965efd721",
      "timestamp": "2022-03-14 21:02:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Loved \"Dear Eywa please help our family to be safe from covid. Please let Michael disappear from our lives and let us be free to raise our kids to be good and to believe in you. All the trees and the flowers and the sun.\"",
      "message_type": "iMessage",
      "sentiment_compound": 0.9638,
      "sentiment_category": "positive",
      "keywords": "help,please,good"
    },
    {
      "message_id": "ffa31382-e7e7-4fb3-b8db-318ab0712d55",
      "timestamp": "2022-02-04 07:14:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Good morning Louisa, I wanted to say good luck for today and I hope everything goes according to your plan and that your voice is heard and you are validated as a human. I love and care for you Louisa and I'll be here for you no matter what happens okay? ❤️",
      "message_type": "iMessage",
      "sentiment_compound": 0.9628,
      "sentiment_category": "positive",
      "keywords": "love,care,good,hope"
    },
    {
      "message_id": "aad66b58-219d-487e-900b-557f75733920",
      "timestamp": "2022-06-09 19:11:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Joshua and Michael said hello \nMichael told joshua that melody is here and wants to say hi\nMelody and Joshua then started talking to each other, Joshua told melody that he was drinking a can of Fanta \nMelody asked joshua what he's been doing and he said he went to rugby \nThere was a pause then melody said goodbye\nMichael came back on and joshua asked Michael to speak to Zelda the dog, Michael said that the dog can't say hello back, Michael then said that grandma was calling and then Joshua's grandparents were there to say hello to him\nThey asked him how his day was and he said he had a good day, they asked him what he did joshua stated to them he can't remember anything and said he went to rugby\nMichael then came back on the call and asked joshua if he had spoken about the treasure maps, joshua asked if he can speak about the treasure maps to his grandma and Michael said yes, then Joshua's grandma came back on the call and asked joshua if he's excited for the treasure map and he said yes\nThen Joshua's grandad came on the call, he said hi and asked joshua what he's doing and joshua was silent and then his grandad said that he will see him on Saturday, the conversation went back with joshua and his grandma, they talked about homework stuff, joshua then asked to speak to Michael \nMichael and joshua then spoke about treasure maps and that joshua wanted to see them on Saturday, Michael said he might be able to see one of them \nMichael asked Joshua to see where joshua was and asked if there were other people around, joshua said he was alone and said that other people were around the house though \nThe conversation then went back to treasure maps \nAfter having a conversation about treasure maps with Michael and everyone else there the conversation ended",
      "message_type": "iMessage",
      "sentiment_compound": 0.9578,
      "sentiment_category": "positive",
      "keywords": "good"
    },
    {
      "message_id": "a7fc39dc-c3ba-42e1-9b5b-16248fd5083e",
      "timestamp": "2021-11-11 09:22:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Thank you for being the best Lulu, I really love you and I love how supportive you are towards me and our family 🥰❤️",
      "message_type": "iMessage",
      "sentiment_compound": 0.9577,
      "sentiment_category": "positive",
      "keywords": "love,thank,best"
    },
    {
      "message_id": "9858e791-ce56-4d0a-99fa-da698c9a8064",
      "timestamp": "2021-12-09 17:15:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Hi Lou, \n\nI'm doing okay thank you and yes I'm all well and you don't have to worry about me finding shelter or food, I'm doing my best. I want to be sure that you and the kids are okay and have enough for everything that you guys need. \n\nThese questions that you have asked me I just right now have no answers to them. The career question though is still the same as we talked about, still studying nursing next year and doing acting/directing in between ",
      "message_type": "iMessage",
      "sentiment_compound": 0.9442,
      "sentiment_category": "positive",
      "keywords": "thank,best,well"
    },
    {
      "message_id": "a050444e-9cd8-4f52-92f8-237c7aebc8c3",
      "timestamp": "2022-06-07 19:11:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "The phone call started with Joshua asking about the treasure maps to see if Michael got them back, Michael said he will get them soon and Joshua wanted to know but Michael said he will show them to him soon and that he's put the treasure maps somewhere special now\nThe conversation then went on about treasure maps and money in the bank \nMichael asked Joshua how his day was and Joshua said it was good\nJoshua then asked Michael to speak to melody but melody was not there tonight as she is at her other house\nAfter this, Joshua reverted the conversation back to the treasure maps and this lasted for a couple of minutes\nMichael then asked Joshua how school was and Joshua said he had forgotten as it's been too long for him to remember \nMichael then asked if Joshua went to school today Joshua replied with \"yes\"\nJoshua then asked what he wanted to do when they see each other, Joshua wanted Michael to open the bank to see the treasure maps but Michael said not yet\nThe conversation then went on about Joshua complaining about how he wants the treasure maps this week\nJoshua then asked Michael what he wanted to talk about, Michael then asked Joshua what he wanted to talk about, Joshua replied with \"did you just want to hang up\", Michael then said maybe we can talk about other things and Michael said he was tired and wanted to go to bed\nThey then said goodbye and the conversation ended",
      "message_type": "iMessage",
      "sentiment_compound": 0.9331,
      "sentiment_category": "positive",
      "keywords": "good"
    },
    {
      "message_id": "0f25173b-f07e-4b2b-93d0-254a2ef0b414",
      "timestamp": "2022-05-24 19:26:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Joshi said hello and straight away wanted to talk to melody \nMichael said he could t because he told her the secret about the treasure maps\nJoshua and Michael then continued to talk about treasure maps\nJoshua asked which house they were in and Michael said a secret house, Joshua then told Michael he wouldn't tell melody about the secrets\nMichael then said to Joshua he wanted him to stay for the whole day this week, Joshua said he can't, Michael responded that he can stay with him for a whole week or a whole year, joshua said he'll have to ask his parents first\nJoshua then went back to the treasure maps conversation, joshua and Michael then talked about secrets and joshua was saying he is good at keeping secrets\nJoshua kept asking to speak to melody and Michael said he can't because she's not there so he can't \nJoshua and Michael then kept talking about treasure maps \nThen joshua brought up to Michael that he could be a clone or a robot \nThe conversation then was about robots and clones \nAfter having a conversation about this, joshua brought the conversation back to treasure maps \nMichael then asked if joshua has a PlayStation and joshua said no he doesn't but Adam has, joshua then talked to Michael about how he played playstation and if he knows the game brawlhalla, Michael then said he will get that game for him \nJoshua asked what he wants to do next week, Michael said he wanted to go on a helicopter and Joshua said his parents wouldn't allow him, Michael then said that he is his dad and that he can take him on a helicopter and that because he is his dad he can listen to him\nJoshua then stated that he didn't want to fly the helicopter \nJoshua then brought up that he wants to be a park ranger or a spy\nMichael then asked Joshua what his favourite helicopter is, Joshua said a boat helicopter and Michael said that's pretty cool\nJoshua then asked for clues for the treasure maps locations \nJoshua then stated he wanted to go, Michael then asked Joshua if anyone told him to hang up and Joshua said no\nJoshua and Michael then talked about things they remember \nMichael then brought up that when Joshua was 2 and that him and Joshua use to hangout all the time together \nThe conversation ended",
      "message_type": "iMessage",
      "sentiment_compound": 0.9302,
      "sentiment_category": "positive",
      "keywords": "together,listen,good"
    },
    {
      "message_id": "2d1ed17c-7a1d-4674-8623-8ebd4ad5aad5",
      "timestamp": "2022-07-18 15:57:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Yeah but I'm not responding to messages like this:\n\n\"A woman's mother dies, she attends the funeral and at the reception she meets a really kind intelligent interesting man. They chat & enjoy each other's company, but don't end up exchanging numbers. \n\nA few weeks later the woman murders her sister.\n\nWhy does she do it?\"",
      "message_type": "iMessage",
      "sentiment_compound": 0.93,
      "sentiment_category": "positive"
    },
    {
      "message_id": "097c02d2-0391-42ca-b7db-5a6f6492b029",
      "timestamp": "2022-01-05 12:31:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "I love you Lou and I love the kids and I care for you guys more than anything okay, I really do. ",
      "message_type": "iMessage",
      "sentiment_compound": 0.9295,
      "sentiment_category": "positive",
      "keywords": "love,care"
    },
    {
      "message_id": "e0473caa-4bd0-49c6-ba2f-271c8ae1af4b",
      "timestamp": "2022-09-17 21:51:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Can Joshua go outside and play and be loved by lots of people such as his friends and family and feel happy yes or no? ",
      "message_type": "iMessage",
      "sentiment_compound": 0.9274,
      "sentiment_category": "positive",
      "keywords": "happy"
    },
    {
      "message_id": "70690c94-eff7-4b03-b28b-704e829d7b70",
      "timestamp": "2022-09-24 21:36:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Hi there Jo, sorry for the late reply been busy all week at the hospital. Thank you to you and everyone else for helping out we are beyond appreciative of it, you've been so great! xx",
      "message_type": "iMessage",
      "sentiment_compound": 0.9265,
      "sentiment_category": "positive",
      "keywords": "thank,sorry"
    },
    {
      "message_id": "9d5d4b30-b541-4bfd-aee4-8171cf7d6c3d",
      "timestamp": "2022-01-09 19:25:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Do you remember when we went and saw Mike that night. That night I could've said so many things to Mike about all the bad things he had done but I didn't Louisa and I'll tell you why, it's because you wanted to cooperate with Mike and you wanted Joshua to see Mike. I knew this is what you wanted and I put everything aside to make sure that this would happen, I put you and Joshua before anything else because I knew you wanted to cooperate with Mike and I knew Joshua wanted to see Mike and be happy. I wanted the things that the two of you wanted without question or hostility. I wanted to make sure that you and Joshua achieved what you both wanted. ",
      "message_type": "iMessage",
      "sentiment_compound": 0.9257,
      "sentiment_category": "positive",
      "keywords": "happy"
    },
    {
      "message_id": "8e6cb7b3-ce09-4d45-9df9-d4277ed83193",
      "timestamp": "2022-02-14 10:50:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "It was good fun and today we now have a boat party and another party somewhere else. Hmmm too many parties for me 🙇🏻‍♂️",
      "message_type": "iMessage",
      "sentiment_compound": 0.9231,
      "sentiment_category": "positive",
      "keywords": "good"
    },
    {
      "message_id": "25cc0bec-c2f8-4edf-852d-63efc646b3ed",
      "timestamp": "2022-08-27 18:38:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "I'm sick of pretending to be happy and loving. There's nothing happy or loving happening g right now ",
      "message_type": "iMessage",
      "sentiment_compound": 0.9231,
      "sentiment_category": "positive",
      "keywords": "happy"
    },
    {
      "message_id": "85d05c50-644d-4cb0-a8ac-c0096726894d",
      "timestamp": "2023-01-18 07:49:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "It must've be nice for Joshua to have his birthday party and be showered with love and gifts from everyone whilst Lily was in bed suffering. He's such a good big 'brother', shows that he really cares",
      "message_type": "iMessage",
      "sentiment_compound": 0.9152,
      "sentiment_category": "positive",
      "keywords": "love,good"
    },
    {
      "message_id": "65c39bd3-257b-40ba-b287-9f90e57a3ab7",
      "timestamp": "2021-11-14 22:13:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "I will be back later soon my darling still playing the pool, I love you and good night 🥰",
      "message_type": "iMessage",
      "sentiment_compound": 0.9136,
      "sentiment_category": "positive",
      "keywords": "love,good"
    },
    {
      "message_id": "7056b909-aeaa-4664-bcee-f9c43fea974a",
      "timestamp": "2022-02-05 14:11:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "You are doing a great job with everything Louisa. I'm very proud of you and you are doing the best you can and that's all anyone ever asks for. ",
      "message_type": "iMessage",
      "sentiment_compound": 0.9134,
      "sentiment_category": "positive",
      "keywords": "best"
    }
  ]
}