{
  "metadata": {
    "batch_id": "batch_1",
    "created_at": "2025-06-03T15:57:34.466454",
    "message_count": 10,
    "message_ids": [
      "97a8fbff-9c27-4b0a-ab17-61bb10e12210",
      "fd11e01e-7958-4e90-bd5a-e1d69acbacd8",
      "a7fc39dc-c3ba-42e1-9b5b-16248fd5083e",
      "961b9776-b925-4aa3-95c2-faa061a2826c",
      "a050444e-9cd8-4f52-92f8-237c7aebc8c3",
      "63f2cd67-37ee-4ad9-a789-8fbf8fbfdc9c",
      "ffa31382-e7e7-4fb3-b8db-318ab0712d55",
      "e0473caa-4bd0-49c6-ba2f-271c8ae1af4b",
      "027b90ac-11d0-4bd1-8069-013670f8cd00",
      "9858e791-ce56-4d0a-99fa-da698c9a8064"
    ]
  },
  "messages": [
    {
      "message_id": "97a8fbff-9c27-4b0a-ab17-61bb10e12210",
      "timestamp": "2022-01-06 18:32:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "This house that I planned to go to is my grandparents house which I told you I was going to. \n\nAgain I did not choose any sides because choosing sides is a ridiculous concept to begin with, you had stated to my Aunty about events that occurred 40-50 years ago about my grandparents, this was your choice to send that message not me, not Lily and not Joshua it was yours. You knew that message would have reactions that weren't going to be in your favour. I'm sorry that this happened and even when it did happen I still stayed with you Louisa. \n\nI have not lied about you to my family. I don't know where you are getting this from but it is not true. \n\nI did not assault you Louisa. We were both in a tight space and I wanted to get through it and you to stood in the way. I apologise that I bumped you into you and wasn't my intention as I thought you were going to move out the way. \n\nI didn't want to leave at all. You had put me in a situation where I have zero choice for both the kids, you state to me that I'm a parent yet you take the choices that parents have for kids away from me. I did not feel like part of the family unit at all Lou. You told me that getting a free car to help me, to help us, to help the family work together would be disrespectful. It doesn't matter where I was getting the car or who I was getting it from. I was looking at the bigger picture so that our family could be more functional especially between you and I but you did not see that. \n\nI don't know what to do with us...I love you Louisa and I always will and I love the kids and I do want to see them BOTH. ",
      "message_type": "iMessage",
      "sentiment_compound": 0.9857,
      "is_positive_relationship": true,
      "is_parental_care": true,
      "is_child_welfare": true,
      "priority_score": 1.6469067260545507
    },
    {
      "message_id": "fd11e01e-7958-4e90-bd5a-e1d69acbacd8",
      "timestamp": "2021-11-06 06:16:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Loved \"Your love is more beautiful than the great art I've seen. \nThe brushstrokes of your friendship is deep and enticing.\nOur system of working together makes me feel exhilarated and safe. \nTravelling with you on this life journey is warm, fresh and joyful. Like morning coffee ☕️ and indoor plants 🌱 \nSweet dreams\"",
      "message_type": "iMessage",
      "sentiment_compound": 0.9915,
      "is_positive_relationship": true,
      "is_parental_care": true,
      "is_child_welfare": true,
      "priority_score": 1.6426776618715608
    },
    {
      "message_id": "a7fc39dc-c3ba-42e1-9b5b-16248fd5083e",
      "timestamp": "2021-11-11 09:22:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Thank you for being the best Lulu, I really love you and I love how supportive you are towards me and our family 🥰❤️",
      "message_type": "iMessage",
      "sentiment_compound": 0.9577,
      "is_positive_relationship": true,
      "is_parental_care": true,
      "is_child_welfare": true,
      "priority_score": 1.6375226870229072
    },
    {
      "message_id": "961b9776-b925-4aa3-95c2-faa061a2826c",
      "timestamp": "2021-09-30 09:21:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Then he must've had a really good supporting family when he was growing up, it sounds like the first like 16 years of his life seemed really good. But obviously he would've had some bad things happened to him, it just sounds like it didn't stick with him. Like I'm not sure how old he was when he got the ball thrown at him by his younger sibling but I can imagine that before that ball was thrown they would've been best friends and played and was happy and then all of a sudden he got physically hurt by his brother and that's why I think that's why he has said that's the worst thing that happened to him, trust me when you have someone physically hurt you after you've had all this fun it sticks with you. ",
      "message_type": "iMessage",
      "sentiment_compound": 0.9659,
      "is_positive_relationship": true,
      "is_parental_care": true,
      "is_child_welfare": true,
      "priority_score": 1.6330861802812249
    },
    {
      "message_id": "a050444e-9cd8-4f52-92f8-237c7aebc8c3",
      "timestamp": "2022-06-07 19:11:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "The phone call started with Joshua asking about the treasure maps to see if Michael got them back, Michael said he will get them soon and Joshua wanted to know but Michael said he will show them to him soon and that he's put the treasure maps somewhere special now\nThe conversation then went on about treasure maps and money in the bank \nMichael asked Joshua how his day was and Joshua said it was good\nJoshua then asked Michael to speak to melody but melody was not there tonight as she is at her other house\nAfter this, Joshua reverted the conversation back to the treasure maps and this lasted for a couple of minutes\nMichael then asked Joshua how school was and Joshua said he had forgotten as it's been too long for him to remember \nMichael then asked if Joshua went to school today Joshua replied with \"yes\"\nJoshua then asked what he wanted to do when they see each other, Joshua wanted Michael to open the bank to see the treasure maps but Michael said not yet\nThe conversation then went on about Joshua complaining about how he wants the treasure maps this week\nJoshua then asked Michael what he wanted to talk about, Michael then asked Joshua what he wanted to talk about, Joshua replied with \"did you just want to hang up\", Michael then said maybe we can talk about other things and Michael said he was tired and wanted to go to bed\nThey then said goodbye and the conversation ended",
      "message_type": "iMessage",
      "sentiment_compound": 0.9331,
      "is_positive_relationship": true,
      "is_parental_care": true,
      "is_child_welfare": true,
      "priority_score": 1.6310067895361033
    },
    {
      "message_id": "63f2cd67-37ee-4ad9-a789-8fbf8fbfdc9c",
      "timestamp": "2022-06-14 13:34:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Loved \"Dear Adam\n\nHave I told you yet today that I love you?\n\nI feel so proud of you for fitting in your work and studies. But I'll also feel proud of you if you don't or if you choose a different path. When I saw you today doing your play with your baby, after just doing an exam, I was so impressed.\n\nI felt so proud when you used our agreed upon discipline plan yesterday with Joshua. \n\nYou are my hero of the day.\n\nLouisa\"",
      "message_type": "iMessage",
      "sentiment_compound": 0.9895,
      "is_positive_relationship": true,
      "is_parental_care": true,
      "is_child_welfare": true,
      "priority_score": 1.6305334099080067
    },
    {
      "message_id": "ffa31382-e7e7-4fb3-b8db-318ab0712d55",
      "timestamp": "2022-02-04 07:14:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Good morning Louisa, I wanted to say good luck for today and I hope everything goes according to your plan and that your voice is heard and you are validated as a human. I love and care for you Louisa and I'll be here for you no matter what happens okay? ❤️",
      "message_type": "iMessage",
      "sentiment_compound": 0.9628,
      "is_positive_relationship": true,
      "is_parental_care": true,
      "is_child_welfare": true,
      "priority_score": 1.6278594831161934
    },
    {
      "message_id": "e0473caa-4bd0-49c6-ba2f-271c8ae1af4b",
      "timestamp": "2022-09-17 21:51:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Can Joshua go outside and play and be loved by lots of people such as his friends and family and feel happy yes or no? ",
      "message_type": "iMessage",
      "sentiment_compound": 0.9274,
      "is_positive_relationship": true,
      "is_parental_care": true,
      "is_child_welfare": true,
      "priority_score": 1.620390241122483
    },
    {
      "message_id": "027b90ac-11d0-4bd1-8069-013670f8cd00",
      "timestamp": "2022-09-11 16:15:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Hi there Jo, can you tell everyone that we are so thankful for the support and love we highly appreciate it a lot. That would be really helpful  for us here, my bank details are\n\nName Adam Edwards \nBSB 066508\nACC 10120201\n\nCan't thank you and everyone else enough honestly, thanks for everything you've all been amazing ❤️❤️",
      "message_type": "iMessage",
      "sentiment_compound": 0.9784,
      "is_positive_relationship": true,
      "is_parental_care": true,
      "is_child_welfare": true,
      "priority_score": 1.6177478441592668
    },
    {
      "message_id": "9858e791-ce56-4d0a-99fa-da698c9a8064",
      "timestamp": "2021-12-09 17:15:00",
      "from_number": 61488180171,
      "to_number": NaN,
      "direction": "incoming",
      "message_text": "Hi Lou, \n\nI'm doing okay thank you and yes I'm all well and you don't have to worry about me finding shelter or food, I'm doing my best. I want to be sure that you and the kids are okay and have enough for everything that you guys need. \n\nThese questions that you have asked me I just right now have no answers to them. The career question though is still the same as we talked about, still studying nursing next year and doing acting/directing in between ",
      "message_type": "iMessage",
      "sentiment_compound": 0.9442,
      "is_positive_relationship": true,
      "is_parental_care": true,
      "is_child_welfare": true,
      "priority_score": 1.6175216849067715
    }
  ]
}